app/controllers/abuckets_controller.rb

  def new
    @help = "New Buckets"
    @abucket = Abucket.new
    @unassigned_buckets = []
    current_user.buckets.each do |bucket|
      if !@account.abuckets.find_by_name(bucket.name)
---
SELECT * FROM "buckets" WHERE ("buckets".user_id = 4)
SELECT * FROM "abuckets" WHERE ("abuckets"."name" = 'Alarm System') AND ("abuckets".account_id = 43) LIMIT 1

  def transaction_detail_report
    @abucket = Abucket.find(params[:id])
    @account = current_user.accounts.find(@abucket.account_id)
---
SELECT * FROM "abuckets" WHERE ("abuckets"."id" = 125)
SELECT * FROM "accounts" WHERE ("accounts"."id" = 43 AND ("accounts".user_id = 4))

  def find_account
    @account = current_user.accounts.find(params[:account_id])
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 43 AND ("accounts".user_id = 4))

  def find_abucket
    @abucket = @account.abuckets.find(params[:id])
---
SELECT * FROM "abuckets" WHERE ("abuckets"."id" = 125 AND ("abuckets".account_id = 43))
SELECT count(*) AS count_all FROM "abuckets" WHERE ("abuckets".account_id = 43)