app/controllers/accounts_controller.rb

  def view_archived_transactions
    @history = @account.histories.find(:all)
---
SELECT * FROM "histories" WHERE ("histories".account_id = 43)

  def purge_archived_transactions
    @history = @account.histories.find(:all)
---
SELECT * FROM "histories" WHERE ("histories".account_id = 43)

  def find_account
    @account = current_user.accounts.find(params[:id])
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 43 AND ("accounts".user_id = 4))
SELECT count(*) AS count_all FROM "accounts" WHERE ("accounts".user_id = 4)