app/controllers/buckets_controller.rb

SELECT * FROM "buckets" WHERE ("buckets"."id" = 30 AND ("buckets".user_id = 4))
---
  def find_bucket
    @bucket = current_user.buckets.find(params[:id])