app/controllers/rbuckets_controller.rb

SELECT * FROM "rbuckets" WHERE ("rbuckets".recurring_id = 23)
SELECT count(*) AS count_all FROM "rbuckets" WHERE ("rbuckets".recurring_id = 27)
SELECT * FROM "rbuckets" WHERE ("rbuckets"."abucket_id" = 125) AND ("rbuckets".recurring_id = 27) LIMIT 1
---
  def new
    @help = "New Recurring Transaction Bucket"
    @rbuckets = @recurring.rbuckets
    @bbuckets = @recurring.find_budget_buckets(@account)
    @ubuckets = @recurring.find_ubuckets(@abuckets)

INSERT INTO "rbuckets" ("recurring_id", "amount", "abucket_id") VALUES(26, 600.0, 149)
---
  def create
    @rbucket = @recurring.rbuckets.build(params[:rbucket])
    respond_to do |format|
      if @rbucket.save

DELETE FROM "rbuckets" WHERE "id" = 63
---
  def destroy
    @rbucket.destroy

SELECT "recurrings".id FROM "recurrings" WHERE ("recurrings"."id" = 26) LIMIT 1
---
  def find_recurring
    @recurring = Recurring.find(params[:recurring_id])

SELECT * FROM "accounts" WHERE ("accounts"."id" = 43)
---
  def find_account
    @account = Account.find(@recurring.account_id)

SELECT * FROM "abuckets" WHERE ("abuckets"."id" = 141 AND ("abuckets".account_id = 43))
---
  def find_abuckets
    @abuckets = @account.abuckets.find(:all)

SELECT * FROM "rbuckets" WHERE ("rbuckets"."id" = 63 AND ("rbuckets".recurring_id = 26))
---
  def find_rbucket
    @rbucket = @recurring.rbuckets.find(params[:id])