app/controllers/recurrings_controller.rb

  def find_account
    @account = Account.find(params[:account_id])
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 43)

  def find_recurring
    @recurring = @account.recurrings.find(params[:id])
---
SELECT * FROM "recurrings" WHERE ("recurrings"."id" = 27 AND ("recurrings".account_id = 43))
SELECT count(*) AS count_all FROM "recurrings" WHERE ("recurrings".account_id = 43)