app/controllers/tbuckets_controller.rb

SELECT * FROM "tbuckets" WHERE ("tbuckets".transaction_id = 46)
SELECT count(*) AS count_all FROM "tbuckets" WHERE ("tbuckets".transaction_id = 46)
SELECT * FROM "tbuckets" WHERE ("tbuckets"."abucket_id" = 125) AND ("tbuckets".transaction_id = 46) LIMIT 1
---
  def new
    @help = "New Transaction Bucket"
    @tbuckets = @transaction.tbuckets
    @bbuckets = @transaction.find_budget_buckets(@account)
    @ubuckets = @transaction.find_ubuckets(@abuckets)

SELECT * FROM "tbuckets" WHERE ("tbuckets".transaction_id = 46)
SELECT count(*) AS count_all FROM "tbuckets" WHERE ("tbuckets".transaction_id = 46)
---
  def edit
    @help = "Edit Transaction Bucket"
    @tbuckets = @transaction.tbuckets
    @bbuckets = @transaction.find_budget_buckets(@account)

UPDATE "tbuckets" SET "wamount" = 1000.0 WHERE "id" = 132
---
  def update
    respond_to do |format|
      if @tbucket.update_attributes(params[:tbucket])

SELECT "transactions".id FROM "transactions" WHERE ("transactions"."id" = 46) LIMIT 1
---
  def find_transaction
    @transaction = Transaction.find(params[:transaction_id])

SELECT * FROM "accounts" WHERE ("accounts"."id" = 43)
---
  def find_account
    @account = Account.find(@transaction.account_id)

SELECT * FROM "abuckets" WHERE ("abuckets"."id" = 141 AND ("abuckets".account_id = 43))
---
  def find_abuckets
    @abuckets = @account.abuckets.find(:all)

SELECT * FROM "tbuckets" WHERE ("tbuckets"."id" = 132 AND ("tbuckets".transaction_id = 46))
---
  def find_tbucket
    @tbucket = @transaction.tbuckets.find(params[:id])