app/controllers/transactions_controller.rb

  def index
    @help = "Transaction List"
    @transactions = @account.transactions.find(:all, :order => "tran_date desc, created_at desc")
---
SELECT * FROM "transactions" WHERE ("transactions".account_id = 43) ORDER BY tran_date desc, created_at desc

  def new
    @help = "New Transaction"
    @transaction = @account.transactions.build
    @recurrings = @account.recurrings.find(:all, :conditions => "transaction_type != 'Budget'")
---
SELECT * FROM "recurrings" WHERE ("recurrings".account_id = 43 AND (transaction_type != 'Budget'))

  def update
    respond_to do |format|
      if @transaction.update_attributes(params[:transaction])
---
UPDATE "transactions" SET "tran_date" = '2009-03-24', "doc_number" = '' WHERE "id" = 46

  def reconcile
    @transaction = Transaction.find(params[:id])
    @account = current_user.accounts.find(@transaction.account_id)
    @transaction.update_attribute(:reconciled, true)
---
SELECT * FROM "transactions" WHERE ("transactions"."id" = 46)
SELECT * FROM "accounts" WHERE ("accounts"."id" = 43 AND ("accounts".user_id = 4))
UPDATE "transactions" SET "reconciled" = 't' WHERE "id" = 46

  def unreconcile
    @transaction = Transaction.find(params[:id])
    @account = current_user.accounts.find(@transaction.account_id)
    @transaction.update_attribute(:reconciled, false)
---
SELECT * FROM "transactions" WHERE ("transactions"."id" = 46)
SELECT * FROM "accounts" WHERE ("accounts"."id" = 43 AND ("accounts".user_id = 4))
UPDATE "transactions" SET "reconciled" = 'f' WHERE "id" = 46

  def find_account
    @account = Account.find(params[:account_id])
---
SELECT "accounts".id FROM "accounts" WHERE ("accounts"."id" = 43) LIMIT 1

  def find_transaction
    @transaction = @account.transactions.find(params[:id])
---
SELECT * FROM "transactions" WHERE ("transactions"."id" = 46 AND ("transactions".account_id = 43))